In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "names" : ["Shaheer", "Abdullah", "Saad"],
    "ages" : [18, 18, 19],
    "cities" : ["Karachi", "Lahore", "Islamabad"],
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

      names  ages     cities
0   Shaheer    18    Karachi
1  Abdullah    18     Lahore
2      Saad    19  Islamabad

In [5]:
df.to_csv("Friends.csv")

In [6]:
df.to_csv("Friends_Index_False.csv", index = False)

In [7]:
df.head(2)

      names  ages   cities
0   Shaheer    18  Karachi
1  Abdullah    18   Lahore

In [8]:
df.tail(2)

      names  ages     cities
1  Abdullah    18     Lahore
2      Saad    19  Islamabad

In [9]:
df.describe()

            ages
count   3.000000
mean   18.333333
std     0.577350
min    18.000000
25%    18.000000
50%    18.000000
75%    18.500000
max    19.000000